### Inspecting Raw Data

In [10]:
import pandas as pd

In [11]:
df = pd.read_excel("../sampleData/Orders-With Nulls.xlsx")

In [12]:
df.head()

,Order ID,Order Date,Order Quantity,Sales,Ship Mode,Profit,Unit Price,Customer Name,Customer Segment,Product Category
0,3,2010-10-13,6,261.5400,Regular Air,-213.250,38.94,Muhammed MacIntyre,Small Business,Office Supplies
1,6,2012-02-20,2,6.9300,Regular Air,-4.640,2.08,Ruben Dartt,Corporate,Office Supplies
2,32,2011-07-15,26,2808.0800,Regular Air,1054.820,107.53,Liz Pelletier,Corporate,Furniture
3,32,2011-07-15,24,1761.4000,Delivery Truck,-1748.560,70.89,Liz Pelletier,Corporate,Furniture
4,32,2011-07-15,23,160.2335,Regular Air,-85.129,7.99,Liz Pelletier,Corporate,Technology

In [13]:
df.describe()

,Order ID,Order Date,Order Quantity,Sales,Profit,Unit Price
count,1007.000000,1007,1007.000000,999.000000,999.000000,1007.000000
mean,3478.923535,2010-12-24 04:24:32.889771776,24.832175,1869.035668,216.914564,91.255045
min,3.000000,2008-07-15 00:00:00,1.000000,2.240000,-4266.088500,1.260000
25%,1665.500000,2010-01-05 00:00:00,12.000000,132.465000,-83.495000,6.480000
50%,3456.000000,2010-12-24 00:00:00,25.000000,412.620000,-1.250000,20.970000
75%,5350.000000,2012-01-04 00:00:00,38.000000,1695.515000,146.608000,95.950000
max,7239.000000,2012-12-28 00:00:00,50.000000,45923.760000,11535.282000,6783.020000
std,2119.704215,NaN,14.367466,3851.570257,1135.726341,294.993321

### Exploring Cleaned Data

In [14]:
clean_df = pd.read_excel("../cleanedData/cleaned_Orders-With Nulls.xlsx")

In [15]:
clean_df.head()

,Order ID,Order Date,Order Quantity,Sales,Ship Mode,Profit,Unit Price,Customer Name,Customer Segment,Product Category
0,3,2010-10-13,6,261.5400,Regular Air,-213.2500,38.94,Muhammed Macintyre,Small Business,Office Supplies
1,6,2012-02-20,2,6.9300,Regular Air,-4.6400,2.08,Ruben Dartt,Corporate,Office Supplies
2,32,2011-07-15,26,2808.0800,Regular Air,491.7625,107.53,Liz Pelletier,Corporate,Furniture
3,32,2011-07-15,24,1761.4000,Delivery Truck,-428.6495,70.89,Liz Pelletier,Corporate,Furniture
4,32,2011-07-15,23,160.2335,Regular Air,-85.1290,7.99,Liz Pelletier,Corporate,Technology

In [16]:
clean_df.describe()

,Order ID,Order Date,Order Quantity,Sales,Profit,Unit Price
count,999.000000,999,999.000000,999.000000,999.000000,999.000000
mean,3506.483483,2010-12-30 22:21:58.918919168,24.820821,1147.468841,43.677269,59.441396
min,3.000000,2009-01-05 00:00:00,1.000000,2.240000,-428.649500,1.260000
25%,1761.500000,2010-01-13 00:00:00,12.000000,132.465000,-83.495000,6.480000
50%,3460.000000,2010-12-25 00:00:00,25.000000,412.620000,-1.250000,20.970000
75%,5379.500000,2012-01-04 12:00:00,38.000000,1695.515000,146.608000,95.690000
max,7239.000000,2012-12-28 00:00:00,50.000000,4040.090000,491.762500,229.505000
std,2105.577835,NaN,14.399014,1406.060501,252.003692,73.656223